app/views/users/show.html.erb

            <td><%= book.body %></td>
            <td><%= link_to "#{book.book_comment.count} コメント", books_path(book.id) %></td>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]