app/views/books/index.html.erb

              <td><%= render 'favorite', book: book %></td>
              <!--<td>コメント数 %= book.book_comments.count %></td>-->
               <td><%= link_to "#{book.book_comment.count} コメント", books_path(book.id) %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books"