app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <!--<div>-->
          <!--  <p>コメント件数：%= @book.book_comments.count %></p>-->

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
            <div>
            <% @book.book_comment.each do |comment| %>

SELECT "book_comments".* FROM "book_comments"
---
              <td><%= attachment_image_tag(comment.user, :profile_image, :fill, 50, 50, fallback: "no-image-icon.jpg") %></td>
              <!--<td>%= link_to "#{book.book_comment.count} コメント", books_path(book.id) %></td>-->