app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    # @user = Book.find(params[:id])
    @user = @book.user
    @books = Book.new
    @comment = BookComment.new
    @comments = BookComment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]