app/controllers/relationships_controller.rb

    def create
        follower = current_user.relationships.build(followed_id: params[:user_id])
        follower.save
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 2], ["created_at", "2021-11-04 05:51:17.725032"], ["updated_at", "2021-11-04 05:51:17.725032"]]

    def destroy
        follower = current_user.relationships.find_by(followed_id: params[:user_id])
        follower.destroy
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = ? AND "relationships"."followed_id" = ? LIMIT ?  [["follower_id", 1], ["followed_id", 2], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 38]]

  def follower
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]