app/controllers/searches_controller.rb

  def search
    @books = Book.all
    @users = User.all
---
SELECT "books".* FROM "books" WHERE (title LIKE '%Ru%')
SELECT "users".* FROM "users"